{
	"root": "#Hello World.",
	"tree": [{
			"content": "##About Me",
			"tree": [{
					"content": "Hi! I'm Wolfram and I am a full-stack developer working primarily on the LAMP stack (although the 'A' has now become more 'AWS' than 'Apache'). Outside of coding, I'm a board gamer, movie buff, and tea enthusiast.\n\nI am currently available for freelance projects. You can find me in Chicago."
				}, {
					"content": "Email: [wolfram.rong@gmail.com](mailto:wolfram.rong@gmail.com)"
				}, {
					"content": "[LinkedIn](https://www.linkedin.com/in/wolfram74) | [GitHub](https://github.com/w74)"
				}
			]
		}, {
			"content": "##Works",
			"tree": [{
					"content": "###Agentis",
					"tree": [{
							"content": "Energy usage monitoring platform with a focus on providing business tools for energy efficiency."
						}, {
							"content": "[Site](https://www.agentisenergy.com)"
						}
					]
				}, {
					"content": "###ActiveCampaign",
					"tree": [{
							"content": "Email marketing platform. Worked on: feature work both on the back-end (LAMP, Laravel) and front-end (EmberJS), maintaining a large legacy monolith codebase and migrating it to (micro)services, and setting up deployment pipelines using Docker/Kubernetes.\n\nAdditionally worked on creating a CSS design system for our marketing site, internal tooling for developers, and creating a company-wide logging (ELK) and metrics (on DataDog) system."
						}, {
							"content": "[Site](https://www.activecampaign.com)"
						}
					]
				}, {
					"content": "###DESIGNATION Labs",
					"tree": [{
							"content": "A design bootcamp located in Chicago that specializes in UI/UX education. Either created or maintained all online sites and resources.\n\nAlso acted as a dev and UX mentor for students, responsible for running workshops and assisting with design tasks."
						}, {
							"content": "~~Designation.io~~ [Now a Part of Flatiron](https://flatironschool.com)"
						}
					]
				}, {
					"content": "###Chicago City of Learning",
					"tree": [{
							"content": "Initiative that focuses on pairing grade school students with learning opportunities that help develop their interests.\n\nWorked with the designers at <a class='inline' href='http://adjustcreative.com'>Adjust Creative</a> to refine the designs and eventually code the pages. Worked on the front-end portion with Foundation and JS."
						}, {
							"content": "[See the Site](https://chicagocityoflearning.org)"
						}
					]
				}, {
					"content": "###SkinIO",
					"tree": [{
							"content": "Marketing page for a startup creating a brand new way for people to take care of their skin. Designed by <a class='inline' href='http://jjleedesign.com'>JJ Lee</a>."
						}, {
							"content": "[See the Site](https://skinio.com)"
						}
					]
				}, {
					"content": "###Audiograph",
					"tree": [{
							"content": "Self-initiated project: music visualizer built with PaperJS. Allows the user to upload their own .mp3 files as well."
						}, {
							"content": "[Play Some Music](http://audiograph.modulo.site)"
						}, {
							"content": "[Source Code](https://github.com/w74/audiograph)"
						}
					]
				}, {
					"content": "[Source code](https://github.com/w74/wolfram74) for this site!"
				}
			]
		}, {
			"content": "##Non-dev. Projects",
			"tree": [{
					"content": "SAIC | Service design project for <a class='inline' href='http://www.saic.edu/cs'>SAIC's Continuing Studies</a> program. Conducted user and alumni research, created personas and drew up storyboards."
				}, {
					"content": "<a class='inline' href='http://erasingthedistance.org'>Erasing the Distance</a> | Service design project for a NPO. Project was primarily focused on making internal financial processes more efficient. Conducted employee and management interviews to create a \"plug-and-play\" pricing calculator."
				}, {
					"content": "~~Campfires.io~~ Now a part of <a class='inline' href='https://flatironschool.com/blog'>Flatiron Blog</a> | Design blog that publishes weekly interviews with notable people in the design world. Sourced, edited, and published the blog copy and media."
				}
			]
		}
	]
}
